In [1]:
import pandas as pd

#### <font color = yellow> Crear Series

In [2]:
data = [1,2,3,4,5]

In [3]:
# creando una serie de pandas con data
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
# crean una lista que va a remplazar los indices de la serie anterior
index = ['indice_' + str(i) for i in range(5)]
index

['indice_0', 'indice_1', 'indice_2', 'indice_3', 'indice_4']

In [8]:
# cambiar el indice de la serie "s" con los indices de "index"
s.index = index
s

indice_0    1
indice_1    2
indice_2    3
indice_3    4
indice_4    5
dtype: int64

#### <font color = yellow> Crear Serie y DataFrame con diccionario

primero crear un diccionario con los valores de ejemplo

In [20]:
data = {'Linea_' + str(i): i+1 for i in range(5)}
data

{'Linea_0': 1, 'Linea_1': 2, 'Linea_2': 3, 'Linea_3': 4, 'Linea_4': 5}

Creando primero la serie

In [16]:
s = pd.Series(data)
s

Linea_0    1
Linea_1    2
Linea_2    3
Linea_3    4
Linea_4    5
dtype: int64

In [18]:
s2 = s * 10
s2

Linea_0    10
Linea_1    20
Linea_2    30
Linea_3    40
Linea_4    50
dtype: int64

Creando el DataFrame con los valores del diccionario 'data'

In [22]:
df = pd.DataFrame([data])
df

   Linea_0  Linea_1  Linea_2  Linea_3  Linea_4
0        1        2        3        4        5

Creando DataFrame desde varias listas

In [23]:
data1 = [[1,2,3], [4,5,6], [7,8,9]]
data1

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [25]:
df1 = pd.DataFrame(data1)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [27]:
# Crear una lista de indices para luego agregarlos al dataframe
index = ['Linea_' + str(i) for i in range(3)]
index

['Linea_0', 'Linea_1', 'Linea_2']

In [29]:
df1 = pd.DataFrame(data1, index = index)
df1

         0  1  2
Linea_0  1  2  3
Linea_1  4  5  6
Linea_2  7  8  9

In [30]:
# Crear una lista de columnas para luego agregarlos al dataframe
column = ['Columna_' + str(i) for i in range(3)]
column

['Columna_0', 'Columna_1', 'Columna_2']

In [31]:
df1 = pd.DataFrame(data1, index = index, columns = column)
df1

         Columna_0  Columna_1  Columna_2
Linea_0          1          2          3
Linea_1          4          5          6
Linea_2          7          8          9

Creando el DataFrame pero usando diccionarios

In [33]:
data2 = {'Columna_0': {'Linea_0': 1, 'Linea_1': 4, 'Linea_2': 7},
        'Columna_1': {'Linea_0': 2, 'Linea_1': 5, 'Linea_2': 8},
        'Columna_2': {'Linea_0': 3, 'Linea_1': 6, 'Linea_2': 9}}
data2

{'Columna_0': {'Linea_0': 1, 'Linea_1': 4, 'Linea_2': 7},
 'Columna_1': {'Linea_0': 2, 'Linea_1': 5, 'Linea_2': 8},
 'Columna_2': {'Linea_0': 3, 'Linea_1': 6, 'Linea_2': 9}}

In [35]:
df2 = pd. DataFrame(data2)
df2

         Columna_0  Columna_1  Columna_2
Linea_0          1          2          3
Linea_1          4          5          6
Linea_2          7          8          9

Creando el dataframe con listas de tuplas

In [43]:
data3 = [(1,2,3), (4,5,6), (7,8,9)]
data3

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [73]:
df3 = pd. DataFrame(data3, index = index, columns = column )
df3

         Columna_0  Columna_1  Columna_2
Linea_0          1          2          3
Linea_1          4          5          6
Linea_2          7          8          9

Remplazando valores en el dataframe

In [74]:
# Crear una copia del dataframe para luego remplazar los valores por una letra
df_A = df3.copy()
df_B = df3.copy()
df_C = df3.copy()

In [75]:
# Remplazando los valores del dataframe con una letra
df_A[df_A > 0] = 'A'
df_B[df_B > 0] = 'B'
df_C[df_C > 0] = 'C'

C:\Users\USUARIO\AppData\Local\Temp\ipykernel_17156\2862656828.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'A' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df_A[df_A > 0] = 'A'
C:\Users\USUARIO\AppData\Local\Temp\ipykernel_17156\2862656828.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'B' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df_B[df_B > 0] = 'B'
C:\Users\USUARIO\AppData\Local\Temp\ipykernel_17156\2862656828.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'C' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df_C[df_C > 0] = 'C'

In [67]:
df_A

        Columna_0 Columna_1 Columna_2
Linea_0         A         A         A
Linea_1         A         A         A
Linea_2         A         A         A

In [76]:
df_B

        Columna_0 Columna_1 Columna_2
Linea_0         B         B         B
Linea_1         B         B         B
Linea_2         B         B         B

In [77]:
df_C

        Columna_0 Columna_1 Columna_2
Linea_0         C         C         C
Linea_1         C         C         C
Linea_2         C         C         C

Concatenar los 3 DataFrames de Letras hacia abajo

In [80]:
df_ABC1 = pd.concat([df_A, df_B, df_C])
df_ABC1

        Columna_0 Columna_1 Columna_2
Linea_0         A         A         A
Linea_1         A         A         A
Linea_2         A         A         A
Linea_0         B         B         B
Linea_1         B         B         B
Linea_2         B         B         B
Linea_0         C         C         C
Linea_1         C         C         C
Linea_2         C         C         C

Concatenar los 3 DataFrames de Letras pero hacia la derecha

In [81]:
df_ABC2 = pd.concat([df_A, df_B, df_C], axis = 1)
df_ABC2

,Columna_0,Columna_1,Columna_2,Columna_0,Columna_1,Columna_2,Columna_0,Columna_1,Columna_2
Linea_0,A,A,A,B,B,B,C,C,C
Linea_1,A,A,A,B,B,B,C,C,C
Linea_2,A,A,A,B,B,B,C,C,C